<!DOCTYPE html>
<html>
  <head>
    <title>OSP-foundry :: Alfphabet</title>
    <meta charset="utf-8"/>
  </head>
  <body><h1>Alfphabet</h1><p><img alt="" src="iceberg/Alfphabet-IV-screen-small.png"/></p>
<p>The Alfphabet family is based on the Belgian road signage system in use from 1945-1975. It came from Minneapolis to Brussels with 3M, an American company working for the Marshall plan after the end of world war II.</p>
<p>Alfphabet IV was redrawn by Pierre Huyghebaert and Ludi at Speculoos studio in 2007.</p>
<p>&#8212;</p>
<p>2011/9/17 Benoit Brunel xxx@gmail.com&gt;:<br/>
&gt; Justement &#231;a concerne l&#8217;article, j&#8217;ai besoin de quelques informations<br/>
&gt; et je sais que tu as les r&#233;ponses.<br/>
&gt; Tu me disais que Michel Olive avait propos&#233; un syst&#232;me de fonts pour&#8230;<br/>
&gt; la SNCB ou la STIB ?<br/>
&gt; Pour&#160;les deux, quel est le syst&#232;me en place? D&#8217;o&#249; vient-il? Belge?</p>
<p>&#8212;</p>
<p>2011/10/2 Pierre Huyghebaert xxx@speculoos.com&gt;<br/>
Michel Olyff a r&#233;pondu &#224; un appel de ce qui s&#8217;appelait le fond des routes, national, vers 1975.<br/>
Ils utilisaient jusque l&#224; des caract&#232;res que les planches appellaient Alfabet ou Alphabet selon la langue.<br/>
Il y avait le type I, II, III, IV et V soit des chasses diff&#233;rentes en majuscules et une &#8220;police&#8221; juste pour les minuscules!<br/>
Son nouveau syst&#232;me signal&#233;tique une fois au point, tr&#232;s moderniste type Frutiger, il a fait produire une &#233;tude comparative de lisibilit&#233;, sur un mode scientifique typique des ann&#233;es 70.<br/>
Mais le fonctionnaire cadre en poste &#224; l&#8217;&#233;poque, que j&#8217;ai rencontr&#233; &#224; la fin de sa carri&#232;re et juste apr&#232;s le d&#233;mant&#232;lement r&#233;gional de son institution fin des ann&#233;es 90, m&#8217;a expliqu&#233; avoir recul&#233; devant le prix demand&#233; par Olyff, pourtant raisonnable : 800000 francs belges soit 20000 euros, qui &#224; l&#8217;&#233;poque devait bien valoir le double. Il a d&#233;cid&#233; d&#8217;opter pour la SNV suisse, gratuite&#8230;<br/>
La SNCB continue parfois a utiliser l&#8217;Alfphabet, vaille que vaille, dans des versions tr&#232;s mal vectoris&#233;es, et m&#233;lang&#233;es au pire, type Arial.<br/>
La STIB l&#8217;a aussi utilis&#233; mais &#224; depuis longtemps vari&#233; ses choix, largement vers l&#8217;Helvetica dans la m&#233;tro, et depuis quelques ann&#233;es avec son changement d&#8217;identit&#233;, une fonte custom transitionnelle &#224; la hollandaise.</p></body>
</html>
